Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum
Enumerator type specifiers.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.ALL_CHILDREN
Selects all children

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.CONNECTED_BOOLEANS
Selects connected boolean objects

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.CONNECTED_BOLTS
Selects connected bolts

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.CONNECTED_WELDS
Selects connected welds

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.CONNECTED_REBARS
Selects connected rebars

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.CONNECTED_SURFACINGS
Selects connected surfaces

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.SELECTED_CHILDREN
Selects selected children

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.CONNECTED_HIERARCHIES
Selects connected hierarchies

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.PARTS_RELATED_TO_POUR
Selects parts related to pour

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.POURS_PART_BELONGS_TO
Selects the pours the part belongs to.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.REBARSET_ADDITIONS
Selects rebar set additions.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.REBARSET_MODIFIERS
Selects rebar set modifiers.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.CONNECTED_SURFACEOBJECTS
Selects connected surface objects

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.OBJECTS_RELATED_TO_POUR
Selects all objects related to pour unit

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.POUR_OBJECT_ASSOCIATED_TO
Selects the pour that the object is associated to.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.POUR_OBJECT_RELATED_TO_POUR_UNIT
Selects the pour object which belongs to the pour unit.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.POUR_UNIT_ASSOCIATED_TO
Selects the pour unit that the object or pour object is associated to.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum.REBARSET_LEG_SURFACES
Selects rebar set leg surfaces.